Revit 2027 API
TopographySurface.Create Method
Overload List
Name | Description
Create(Document, IList<XYZ>) | Obsolete.
 Creates a new topography surface element and adds it to the document.
Create(Document, IList<XYZ>, IList<PolymeshFacet>) | Obsolete.
 Creates a new topography surface element from facets and adds it to the document.
Top
See Also
Reference
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace